[Demo_Common_ep1_4_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-312,Y=-3520,Z=135),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=180,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-502,Y=-3520,Z=0),VecSub=(X=0,Y=0,Z=0),CId=71)
DemoScripts[4]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[5]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[6]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Positive.GG2_BGM_DM_CMN_Positive_Cue')
DemoScripts[7]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Schoolzone.GG2_AMB_Schoolzone_LP_Cue')
DemoScripts[8]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[9]=(Actor=FADE,Command=WAIT)
DemoScripts[10]=(Actor=WINDOW,Command=SET)
DemoScripts[11]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[12]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[13]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0100_fx_close_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0111_fx_Stand2Proud",Rate=0,Number=3,Bit=0)
DemoScripts[14]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1100_lp_Proud",Number=8)
DemoScripts[15]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_4.GG2_V_CMN_ep1_4_003_Cue',Name="エコロ")
DemoScripts[16]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[17]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[18]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[19]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_1101_fx_Proud2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[20]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[21]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_4.GG2_V_CMN_ep1_4_005_Cue',Name="エコロ")
DemoScripts[22]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[23]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[24]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[25]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0201_lp_half_angry",motionName[1]="ek_CM_0000_fx_close_normal",motionName[2]="ek_DM_0105_fx_Stand2Seamon",Rate=0,Number=3,Bit=1)
DemoScripts[26]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0500_lp_Sermon",Number=8)
DemoScripts[27]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_4.GG2_V_CMN_ep1_4_007_Cue',Name="エコロ")
DemoScripts[28]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[29]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[30]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[31]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0000_lp_open_normal",motionName[1]="ek_CM_0002_fx_close_smile_S",motionName[2]="ek_DM_0501_fx_Seamon2Stand",Rate=0,Number=3,Bit=1)
DemoScripts[32]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[33]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Common_ep1_4.GG2_V_CMN_ep1_4_009_Cue',Name="エコロ")
DemoScripts[34]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[35]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[36]=(Actor=WINDOW,Command=EXIT)
DemoScripts[37]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[38]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[39]=(Actor=AMBIENT,Command=STOP,SecTime=2,SoundID=)
DemoScripts[40]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[41]=(Actor=SYSTEM,Command=END)

[Select_Common_ep1_4_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Common_ep1_4_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="嗯,雖說是來到校舍前了--")

Texts[1]=(Label="TEXT02",Name="峯大",Text="我該不會得要帶著妳/n在校內到處晃吧?/n感覺會有各式各樣的問題耶.")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="請放心./n現在我的身影/n只有峯大大人才看得見.")

Texts[3]=(Label="TEXT04",Name="峯大",Text="哦~是天使的神奇力量之類的嗎?")

Texts[4]=(Label="TEXT05",Name="艾可蘿",Text="嗯,差不多就是那樣./n明白的話就開始在校內徘徊/n尋找命運的對象吧!")

Texts[5]=(Label="TEXT06",Name="峯大",Text="說什麼徘徊....../n簡直就是可疑人士啊.")

Texts[6]=(Label="TEXT07",Name="艾可蘿",Text="事到如今還說這什麼話啊./n既然是要到處讓女孩子昇天,/n行徑完全就是個可疑人士哦.")

Texts[7]=(Label="TEXT08",Name="峯大",Text="雖然由妳來說讓我有點難以釋懷,/n不過......確實是這樣.")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="看來你已經接受了呢./n那就出發吧!")

Texts[9]=(Label="",Name="",Text="")

Texts[10]=(Label="SELECT01",Name="",Text="")

Texts[11]=(Label="SELECT02",Name="",Text="")

Texts[12]=(Label="SELECT03",Name="",Text="")

Texts[13]=(Label="SELECT04",Name="",Text="")

Texts[14]=(Label="SELECT05",Name="",Text="")

Texts[15]=(Label="SELECT06",Name="",Text="")

Texts[16]=(Label="SELECT07",Name="",Text="")

Texts[17]=(Label="SELECT08",Name="",Text="")

Texts[18]=(Label="SELECT09",Name="",Text="")

Texts[19]=(Label="SELECT10",Name="",Text="")


